In [1]:
import numpy as np
import pandas as pd

In [6]:
arr1= pd.array([i for i in range(1,20)])
arr1

<IntegerArray>
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
Length: 19, dtype: Int64

In [9]:
ser1= pd.Series(arr1)
ser1

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
dtype: Int64

In [10]:
arr2= pd.array([i for i in range(1,20)])
ser2= pd.Series(arr2)
ser2

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
dtype: Int64

In [11]:
print(ser1 + ser2)

0      2
1      4
2      6
3      8
4     10
5     12
6     14
7     16
8     18
9     20
10    22
11    24
12    26
13    28
14    30
15    32
16    34
17    36
18    38
dtype: Int64

In [12]:
print(ser1 - ser2)

0     0
1     0
2     0
3     0
4     0
5     0
6     0
7     0
8     0
9     0
10    0
11    0
12    0
13    0
14    0
15    0
16    0
17    0
18    0
dtype: Int64

In [13]:
print(ser1 * ser2)

0       1
1       4
2       9
3      16
4      25
5      36
6      49
7      64
8      81
9     100
10    121
11    144
12    169
13    196
14    225
15    256
16    289
17    324
18    361
dtype: Int64

In [14]:
print(ser1 / ser2)

0     1.0
1     1.0
2     1.0
3     1.0
4     1.0
5     1.0
6     1.0
7     1.0
8     1.0
9     1.0
10    1.0
11    1.0
12    1.0
13    1.0
14    1.0
15    1.0
16    1.0
17    1.0
18    1.0
dtype: Float64

In [15]:
ser1== ser2

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
16    True
17    True
18    True
dtype: boolean

In [26]:
df= pd.DataFrame({'col 1':ser1,'col 2':ser2})
df

    col 1  col 2
0       1      1
1       2      2
2       3      3
3       4      4
4       5      5
5       6      6
6       7      7
7       8      8
8       9      9
9      10     10
10     11     11
11     12     12
12     13     13
13     14     14
14     15     15
15     16     16
16     17     17
17     18     18
18     19     19

In [32]:
d= {'name':['Arvind','Murthy','Vamsi','Siva'],'salary':[34000,37000,20000,20000]}

df2= pd.DataFrame(d)

In [38]:
df2[['name','salary']]

     name  salary
0  Arvind   34000
1  Murthy   37000
2   Vamsi   20000
3    Siva   20000

In [43]:
df2[df2['salary']<25000]

    name  salary
2  Vamsi   20000
3   Siva   20000

In [69]:
d= {'name':['Arvind','Murthy','Vamsi','Siva'],'salary':[34000,37000,20000,20000],'score':[100,89,77,88]}

df2= pd.DataFrame(d)
df2

     name  salary  score
0  Arvind   34000    100
1  Murthy   37000     89
2   Vamsi   20000     77
3    Siva   20000     88

In [46]:
df2[df2['score']<80]

    name  salary  score
2  Vamsi   20000     77

In [58]:
df2['attempts']= [1,2,3,4]
df2

df2

     name  salary  score  attempts
0  Arvind   34000    100         1
1  Murthy   37000     89         2
2   Vamsi   20000     77         3
3    Siva   20000     88         4

In [59]:
df2.drop('attempts',axis=1, inplace= True)
df2

     name  salary  score
0  Arvind   34000    100
1  Murthy   37000     89
2   Vamsi   20000     77
3    Siva   20000     88

In [62]:
df2.sort_values(by= ['name','score'],ascending=[False, True])

     name  salary  score
2   Vamsi   20000     77
3    Siva   20000     88
1  Murthy   37000     89
0  Arvind   34000    100

In [64]:
df2['new Col']= [2,3,4,5]
df2

     name  salary  score  new Col
0  Arvind   34000    100        2
1  Murthy   37000     89        3
2   Vamsi   20000     77        4
3    Siva   20000     88        5

In [71]:
df2.loc[df2['name']=='Siva','name']= 'Kranthi'
df2

      name  salary  score
0   Arvind   34000    100
1   Murthy   37000     89
2    Vamsi   20000     77
3  Kranthi   20000     88